CREATE TABLE EMPLOYEE (
  EMP_CODE VARCHAR(20) PRIMARY KEY,
  EMP_NAME VARCHAR(20) NOT NULL,
  EMP_MST VARCHAR(20),
  EMP_SAL INT NOT NULL,
  EMP_RCODE VARCHAR(20),
  CONSTRAINT emp_rcode_fk FOREIGN KEY(EMP_RCODE) 
  REFERENCES EMP_ROLE(EMP_RCODE)
);

INSERT INTO EMPLOYEE VALUES
  ('E001', '±è¹ÎÈÆ', 'E202', 5500, 'R001'),
  ('E002', '¼ÕÁö¹Î', 'E201', 4500, 'R001'),
  ('E003', 'ÀÌ¼ø½Å', 'E203', 9500, 'R001'),
  ('E004', '°­Çõ¹Î', 'E201', 3500, 'R001'),
  ('E005', '¿ÁÁÖÀÎ', 'E201', 3500, 'R001'),
  ('E006', '½Å½Â¸ð', 'E202', 7500, 'R001'),
  ('E007', '±è°ÇÈÆ', 'E202', 7500, 'R001'),
  ('E008', '¼Ò³â½Ã´ë', 'E203', 8500, 'R001'),
  ('E009', 'À¯Àçµ¿', 'E203', 8500, 'R001'),
  ('E101', '°­µ¿¹Î', 'E902', 7500, 'R002'),
  ('E102', '¹®¼ºÁØ', 'E902', 7500, 'R002'),
  ('E103', 'ÇÑµ¿È­', 'E902', 7500, 'R002'),
  ('E201', 'È«±æµ¿', 'E902', 3000, 'R003'),
  ('E202', 'ÀÏÁö¸Å', 'E101', 2750, 'R004'),
  ('E203', '±è¼öÇö', 'E102', 2750, 'R004'),
  ('E204', '½Å¿ëÁÖ', 'E103', 2500, 'R005'),
  ('E901', 'ÀÌ¼ö¹Î', NULL, 5000, 'R007'),
  ('E902', '±è¹ÎÈÆ', 'E901', 4000, 'R006');